
// # Задача 3

// Необхідно створити функцію, яка приймає будь-яку кількість аргументів (чисел) і
// повертає максимальне значення серед них. Аргументи можуть бути передані як
// окремими значеннями, так і в масиві.

// ```javascript
// findMax(1, 4, 2, 8, 5); // поверне 8
// findMax([1, 4, 2], 8, 5); // поверне 8
// findMax(1, 4, [2, 8, 5]); // поверне 8
// ```

function findMax(...args){
  const newArray = args.flat();
  console.log(Math.max(...newArray)); 
 
}
findMax(1, 4, 2, 8, 5); // поверне 8
findMax([1, 4, 2], 8, 5); // поверне 8
findMax(1, 4, [2, 8, 5]); // поверне 8